TexasInstruments/mcu_plus_sdk_am263px/examples/drivers/boot/sbl_ospi_enet/am263px-cc/r5fss0-0_nortos/example.syscfg
/**
 * AI AGENTS: Do not edit this file directly. There is no validation or error feedback when
 * editing manually — mistakes will be silent until the file is loaded in SysConfig.
 * Use the SysConfig MCP server instead to make changes with immediate error reporting.
 *
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --device "AM263Px" --part "AM263P4" --package "ZCZ_S" --context "r5fss0-0" --product "MCU_PLUS_SDK_AM263Px@26.01.00"
 * @v2CliArgs --device "AM263P4-Q1" --package "NFBGA (ZCZ-S)" --context "r5fss0-0" --product "MCU_PLUS_SDK_AM263Px@26.01.00"
 * @versions {"tool":"1.28.0+4712"}
 */

/**
 * Import the modules used in this configuration.
 */
const eeprom          = scripting.addModule("/board/eeprom/eeprom", {}, false);
const eeprom1         = eeprom.addInstance();
const flash           = scripting.addModule("/board/flash/flash", {}, false);
const flash1          = flash.addInstance();
const bootloader      = scripting.addModule("/drivers/bootloader/bootloader", {}, false);
const bootloader1     = bootloader.addInstance();
const gpio            = scripting.addModule("/drivers/gpio/gpio", {}, false);
const gpio1           = gpio.addInstance();
const hsmclient       = scripting.addModule("/drivers/hsmclient/hsmclient", {}, false);
const hsmclient1      = hsmclient.addInstance();
const i2c             = scripting.addModule("/drivers/i2c/i2c", {}, false);
const i2c1            = i2c.addInstance();
const i2c2            = i2c.addInstance();
const debug_log       = scripting.addModule("/kernel/dpl/debug_log");
const dpl_cfg         = scripting.addModule("/kernel/dpl/dpl_cfg");
const mpu_armv7       = scripting.addModule("/kernel/dpl/mpu_armv7", {}, false);
const mpu_armv71      = mpu_armv7.addInstance();
const mpu_armv72      = mpu_armv7.addInstance();
const mpu_armv73      = mpu_armv7.addInstance();
const mpu_armv74      = mpu_armv7.addInstance();
const mpu_armv75      = mpu_armv7.addInstance();
const mpu_armv76      = mpu_armv7.addInstance();
const mpu_armv77      = mpu_armv7.addInstance();
const mpu_armv78      = mpu_armv7.addInstance();
const default_linker  = scripting.addModule("/memory_configurator/default_linker", {}, false);
const default_linker1 = default_linker.addInstance();
const general         = scripting.addModule("/memory_configurator/general", {}, false);
const general1        = general.addInstance();
const region          = scripting.addModule("/memory_configurator/region", {}, false);
const region1         = region.addInstance();
const section         = scripting.addModule("/memory_configurator/section", {}, false);
const section1        = section.addInstance();
const section2        = section.addInstance();
const section3        = section.addInstance();
const section4        = section.addInstance();
const section5        = section.addInstance();
const section6        = section.addInstance();
const section7        = section.addInstance();
const section8        = section.addInstance();
const section9        = section.addInstance();
const section10       = section.addInstance();
const section11       = section.addInstance();
const enet_cpsw       = scripting.addModule("/networking/enet_cpsw/enet_cpsw", {}, false);
const enet_cpsw1      = enet_cpsw.addInstance();

/**
 * Write custom configuration values to the imported modules.
 */
eeprom1.$name = "CONFIG_EEPROM0";

bootloader1.$name            = "CONFIG_BOOTLOADER0";
bootloader1.appImageOffset   = "0x00081000";
bootloader1.hsmrtImageOffset = "0x00040000";

flash1.$name                                    = "CONFIG_FLASH0";
bootloader1.flashDriver                         = flash1;
flash1.xspiWipRdCmd                             = "0x05";
flash1.fourByteEnableSeq                        = "0";
flash1.cmdRd                                    = "0x7c";
flash1.dummy_mask                               = "0xff";
flash1.peripheralDriver.$name                   = "CONFIG_OSPI0";
flash1.peripheralDriver.dmaEnable               = true;
flash1.peripheralDriver.phyEnable               = true;
flash1.peripheralDriver.OSPI.CLK.$assign        = "OSPI0_CLK";
flash1.peripheralDriver.OSPI.CSn0.$assign       = "OSPI0_CSn0";
flash1.peripheralDriver.OSPI.DQS.$assign        = "UART1_TXD";
flash1.peripheralDriver.OSPI.D7.$assign         = "MCAN1_TX";
flash1.peripheralDriver.OSPI.D6.$assign         = "MCAN1_RX";
flash1.peripheralDriver.OSPI.D5.$assign         = "MCAN0_TX";
flash1.peripheralDriver.OSPI.D4.$assign         = "MCAN0_RX";
flash1.peripheralDriver.OSPI.D3.$assign         = "OSPI0_D3";
flash1.peripheralDriver.OSPI.D2.$assign         = "OSPI0_D2";
flash1.peripheralDriver.OSPI.D1.$assign         = "OSPI0_D1";
flash1.peripheralDriver.OSPI.D0.$assign         = "OSPI0_D0";
flash1.peripheralDriver.OSPI.RESET_OUT0.$assign = "EPWM11_B";
flash1.peripheralDriver.child.$name             = "drivers_ospi_v0_ospi_v0_am263px_template0";

const edma                         = scripting.addModule("/drivers/edma/edma", {}, false);
const edma1                        = edma.addInstance({}, false);
edma1.$name                        = "CONFIG_EDMA0";
flash1.peripheralDriver.edmaDriver = edma1;
edma1.edmaRmDmaCh[0].$name         = "CONFIG_EDMA_RM0";
edma1.edmaRmQdmaCh[0].$name        = "CONFIG_EDMA_RM1";
edma1.edmaRmTcc[0].$name           = "CONFIG_EDMA_RM2";
edma1.edmaRmParam[0].$name         = "CONFIG_EDMA_RM3";

gpio1.$name          = "ENET_TRANSFER_START_BTN";
gpio1.trigType       = "RISE_EDGE";
gpio1.rx             = true;
gpio1.GPIO_n.$assign = "LIN2_RXD";

hsmclient1.$name = "CONFIG_HSMCLIENT0";

i2c1.$name           = "CONFIG_I2C0";
i2c1.I2C.$assign     = "I2C2";
i2c1.I2C.SCL.$assign = "UART0_RTSn";
i2c1.I2C.SDA.$assign = "UART0_CTSn";
i2c1.I2C_child.$name = "drivers_i2c_v1_i2c_v1_template1";

i2c2.$name               = "CONFIG_I2C1";
eeprom1.peripheralDriver = i2c2;
i2c2.I2C.$assign         = "I2C0";
i2c2.I2C_child.$name     = "drivers_i2c_v1_i2c_v1_template2";

debug_log.enableUartLog            = true;
debug_log.uartLog.$name            = "CONFIG_UART0";
debug_log.uartLog.intrEnable       = "DISABLE";
debug_log.uartLog.UART.RXD.$assign = "UART0_RXD";
debug_log.uartLog.UART.TXD.$assign = "UART0_TXD";
debug_log.uartLog.child.$name      = "drivers_uart_v2_uart_v2_template0";

mpu_armv71.$name             = "CONFIG_MPU_REGION0";
mpu_armv71.size              = 31;
mpu_armv71.attributes        = "Device";
mpu_armv71.accessPermissions = "Supervisor RD+WR, User RD";
mpu_armv71.allowExecute      = false;

